Revit 2027 API
FabricationConfiguration.SetConfiguration(FabricationConfigurationInfo, String) Method
 Set the fabrication configuration with specific profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetConfiguration(
	FabricationConfigurationInfo fabricationConfigurationInfo,
	string profile
)
Public Sub SetConfiguration (
	fabricationConfigurationInfo As FabricationConfigurationInfo,
	profile As String
)
public:
void SetConfiguration(
	FabricationConfigurationInfo^ fabricationConfigurationInfo,
	String^ profile
)
member SetConfiguration :
        fabricationConfigurationInfo : FabricationConfigurationInfo *
        profile : string -> unit
Parameters
fabricationConfigurationInfo FabricationConfigurationInfo
 The desired fabrication configuration.
profile String
 The desired profile of the fabrication configuration. Use empty string for the global profile.
Exceptions
Exception | Condition
ArgumentException |  The profile "profile" is invalid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document. -or- Cannot set the configuration.
See Also
Reference
FabricationConfiguration Class
SetConfiguration Overload
Autodesk.Revit.DB Namespace